Revit 2024 API
PerformanceAdviser.IsRuleEnabled Method (PerformanceAdviserRuleId)
 Retrieves an enabled/disabled status for the given rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsRuleEnabled(
	PerformanceAdviserRuleId id
)
Visual Basic
Public Function IsRuleEnabled ( _
	id As PerformanceAdviserRuleId _
) As Boolean
Visual C++
public:
bool IsRuleEnabled(
	PerformanceAdviserRuleId^ id
)
Parameters
id
Type: Autodesk.Revit.DB.PerformanceAdviserRuleId
 The rule id to retrieve enabled/disabled status for.
Return Value
 True if rule is disabled, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The id does not correspond to any registered rule.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PerformanceAdviser Class
IsRuleEnabled Overload
Autodesk.Revit.DB Namespace